In [1]:
import numpy as np
from IPython.display import display
import pandas as pd

In [66]:
df = pd.DataFrame({'A':[None, 2, 3, None, 5], 'B':[10, None, None, 40, 50], 'C':[100, None, 300, 400,None]})
display(df)

     A     B      C
0  NaN  10.0  100.0
1  2.0   NaN    NaN
2  3.0   NaN  300.0
3  NaN  40.0  400.0
4  5.0  50.0    NaN

In [84]:
# Eliminate any row in the dataframe that contains at least one NaN value
display(df.dropna())

Empty DataFrame
Columns: [A, B, C]
Index: []

In [87]:
#  Modify the previous task and eliminate only those rows which have NaN values across all columns
# display(df.dropna(axis=0))
df.dropna(subset=['A', 'B', 'C'], thresh=2)

     A     B      C
0  NaN  10.0  100.0
2  3.0   NaN  300.0
3  NaN  40.0  400.0
4  5.0  50.0    NaN

In [33]:
# Eliminate all rows that have NaN at least 1 NaN value in the ‘A’ and ‘C’ columns only
# הסרת שורות שיש להן לפחות ערך NaN בעמודות 'A' ו-'C'
df.dropna(subset=['A', 'C'])

     A   B      C
2  3.0 NaN  300.0

In [105]:
# Replace all NaN values with a specified value at your choice
df.dropna(thresh=2, axis=0)

     A     B      C
0  NaN  10.0  100.0
2  3.0   NaN  300.0
3  NaN  40.0  400.0
4  5.0  50.0    NaN

In [98]:
# Replace all NaN values in a specific column 'B' with the mean of non-NaN values in that column
# חישוב הממוצע של ערכים שאינם NaN בעמודה 'B'
display(df[['B']].fillna(0))
print('nmean = ', df['B'].mean())

      B
0  10.0
1   0.0
2   0.0
3  40.0
4  50.0

nmean =  33.333333333333336